import type { Question } from '../types/game';

export const questions: Question[] = [
  {
   
      id: '1',
      text: '1) Which letter is used on the number plate of government motorcycles?',
      options: ['ब', 'प', 'झ', 'क'],
      correctAnswer: 3
     
  },
 
  {
    id: '2',
    text: '2) ओभरटेक गर्दा कुन साइडबाट गर्नु पर्छ?',
    options: ['बायाँ', 'दायाँ', 'दुबै', 'कुनै पनि होइन'],
    correctAnswer: 1
  },
  {
    id: '3',
    text: '3) What should be checked before starting a vehicle?',
    options: ['Brakes', 'Lights', 'Fuel', 'All of the above'],
    correctAnswer: 3
  },
 
  {
    id: '4',
    text: '4) मोटरसाइकल दर्ता गर्ने निकाय कुन हो?',
    options: ['यातायात व्यवस्था विभाग', 'जिल्ला प्रशासन कार्यालय', 'यातायात व्यवस्था कार्यालय', 'भौतिक पूर्वाधार तथा यातायात मन्त्रालय'],
    correctAnswer: 2
  },
 
  {
    id: '5',
    text: '5) सहरी इलाकामा सवारी चलाउँदा के गर्नुपर्छ?',
    options: ['गति कम गर्नुपर्छ', 'गति बढाउनुपर्छ', 'सवारी रोक्नुपर्छ', 'कुनै पनि होइन'],
    correctAnswer: 0
  },
 
  {
    id: '6',
    text: '6) कुन अवस्था मा सवारी साधन चलाउनु हुँदैन?',
    options: ['मादक पदार्थ सेवन गरेर', 'कलर छुट्याउन नसक्ने अवस्थामा', 'दृष्टि कमजोर हुँदा', 'माथिका सबै'],
    correctAnswer: 3
  },
  {
    id: '7',
    text: '7) स्कूल अगाडि सवारी चलाउँदा के गर्नुपर्छ?',
    options: ['गति कम गर्नुपर्छ', 'हर्न बजाउनु पर्छ', 'ओभरटेक गर्नुपर्छ', 'माथिका सबै'],
    correctAnswer: 0
  },
  
  {
    id: '8',
    text: '8) तपाईंको सवारी पछाडि एम्बुलेन्स आएमा के गर्नुपर्छ?',
    options: ['सवारी रोक्नु', 'साइड दिनु', 'गति बढाउनु', 'ओभरटेक गर्नु'],
    correctAnswer: 1
  },

  
  {
    id: '9',
    text: '9) सवारी चालक अनुमतिपत्र लिन कस्तो स्वास्थ्य अवस्था हुनु पर्छ?',
    options: ['दृष्टि राम्रो', 'शारीरिक स्वास्थ्य राम्रो', 'ट्राफिक नियमको ज्ञान', 'माथिका सबै'],
    correctAnswer: 3
  },
  {
    id: '10',
    text: '10) सवारी चालक अनुमतिपत्र लिन न्यूनतम उमेर कति हो?',
    options: ['१६ वर्ष', '१८ वर्ष', '२० वर्ष', '२५ वर्ष'],
    correctAnswer: 1
  },
  {
    id: '11',
    text: '11) सवारी चालकले हेल्मेट किन लगाउनुपर्छ?',
    options: ['सजिलोका लागि', 'सुरक्षाका लागि', 'सजावटका लागि', 'कुनै पनि होइन'],
    correctAnswer: 1
  },
  {
    id: '12',
    text: '12) सवारीको इन्धन कति समयमा जाँच गर्नुपर्छ?',
    options: ['दैनिक', 'हप्तामा', 'महिनामा', 'जहिले पनि'],
    correctAnswer: 0
  },
  {
    id: '13',
    text: '13) पानी परेको बेलामा विशेष ध्यान पुर्याउनु पर्ने कुराहरू के के हुन्?',
    options: ['सडकको सतह', 'ब्रेकको स्थिति', 'पदयात्रीलाई क्षति नपुर्याउने', 'माथिका सबै'],
    correctAnswer: 3
  },
  
  {
    id: '14',
    text: '14) सवारी चलाउँदा नियमित चेकअप किन आवश्यक छ?',
    options: ['खर्च कम गर्न', 'दुर्घटना टार्न', 'समय बचाउन', 'कुनै पनि'],
    correctAnswer: 1
  },
  {
    id: '15',
    text: '15) पदयात्रीले सडक कहाँबाट काट्नुपर्छ?',
    options: ['जेब्रा क्रस', 'सडकको बिचबाट', 'जहाँ पनि', 'कुनै पनि'],
    correctAnswer: 0
  },
  {
    id: '16',
    text: '16) मोटरसाइकलको सर्भिस कहिले गर्नु पर्छ?',
    options: ['मात्र बिग्रिएपछि', 'हप्तामा एकपटक', 'महिनामा एकपटक', 'निश्चित समयमा'],
    correctAnswer: 3
  },
  {
    id: '17',
    text: '17) सवारी चालक अनुमतिपत्रको म्याद कति समयसम्मको हुन्छ?',
    options: ['१ वर्ष', '२ वर्ष', '५ वर्ष', '१० वर्ष'],
    correctAnswer: 2
  },
 
  {
    id: '18',
    text: '18) सवारी साधनको चक्का चिप्लनबाट बच्न के गर्नुपर्छ?',
    options: ['ब्रेक हल्का थिच्ने', 'ब्रेक बेस्सरी थिच्ने', 'क्लच थिच्ने', 'गति बढाउने'],
    correctAnswer: 0
  },
  
  {
    id: '19',
    text: '19) सवारी चालकले ट्राफिक नियम पालना नगर्दा के हुन सक्छ?',
    options: ['दण्ड', 'जरिवाना', 'सवारी रोक्का', 'माथिका सबै'],
    correctAnswer: 3
  },
 
  {
    id: '20',
    text: '20) सवारी चालक अनुमतिपत्र लिन कुन परीक्षा दिनुपर्छ?',
    options: ['लेखित', 'व्यावहारिक', 'दुवै', 'कुनै पनि'],
    correctAnswer: 2
  },

  {
    id: '21',
    text: '21) सहरी इलाकामा अधिकतम गति कति हुनुपर्छ?',
    options: ['३० किमी/घंटा', '५० किमी/घंटा', '७० किमी/घंटा', '१०० किमी/घंटा'],
    correctAnswer: 0
  },
  {
    id: '22',
    text: '22) Which color number plate indicates a public vehicle?',
    options: ['Red', 'Green', 'Black', 'Blue'],
    correctAnswer: 2
  },
 
  {
    id: '23',
    text: '23) सवारी साधनको पछाडिको रातो बत्ती कहिले बल्छ?',
    options: ['एसेलेटर बढाउँदा', 'ब्रेक थिच्दा', 'हर्न बजाउँदा', 'कुनै पनि'],
    correctAnswer: 1
  },
 
 
  {
    id: '24',
    text: '24) सवारी साधन चलाउँदै गर्दा कस्तो अवस्थामा ब्रेक प्रयोग गर्नु हुँदैन?',
    options: ['ओरालोमा', 'मोडमा', 'गति बढाउँदै गर्दा', 'माथिका सबै'],
    correctAnswer: 2
  },
 
  {
    id: '25',
    text: '25) यातायात व्यबस्था विभागले कुन कार्य सम्पादन गर्दछ?',
    options: ['सवारी दर्ता', 'सवारी अनुमतिपत्र वितरण', 'सवारी कर संकलन', 'माथिका सबै'],
    correctAnswer: 3
  },
  {
    id: '26',
    text: '26) पदयात्रीलाई सडक पार गर्न कुन स्थान प्रयोग गर्नुपर्छ?',
    options: ['जेब्रा क्रस', 'आकाशे पुल', 'दुवै', 'कुनै पनि होइन'],
    correctAnswer: 2
  },
 
  {
    id: '27',
    text: '27) सवारी साधनले हरियो नम्बर प्लेट प्रयोग गर्दा के जनाउँछ?',
    options: ['सरकारी सवारी', 'डिप्लोम्याटिक सवारी', 'पर्यटक सवारी', 'सार्वजनिक सवारी'],
    correctAnswer: 2
  },
  
  {
    id: '28',
    text: '28) ट्राफिक बत्तीको पहेलो बत्तीले के जनाउँछ?',
    options: ['रोक्न', 'सावधान हुन', 'आगाडि बढ्न', 'कुनै पनि होइन'],
    correctAnswer: 1
  },
  {
    id: '29',
    text: '29) What is the  amount required to obtain a motorcycle driving license?',
    options: ['Rs. 700', 'Rs. 1000', 'Rs. 1500', 'Rs. 2000'],
    correctAnswer: 2
  },
  {
    id: '30',
    text: '30) What type of vehicle does a green number plate represent?',
    options: ['Tourist vehicle', 'Public vehicle', 'Institutional vehicle', 'Diplomatic vehicle'],
    correctAnswer: 0
  },
  {
    id: '31',
    text: '31) सवारी साधनको लेन परिवर्तन गर्दा के गर्नुपर्छ?',
    options: ['साइडलाइट दिनु', 'हेर्नु', 'गति घटाउनु', 'माथिका सबै'],
    correctAnswer: 3
  },
  {
    id: '32',
    text: '32) Which type of vehicle has a white number plate?',
    options: ['Government vehicle', 'Public vehicle', 'Institutional vehicle', 'Tourist vehicle'],
    correctAnswer: 0
  },
  {
    id: '33',
    text: '33) मोटरसाइकलको क्लच कस्तो अवस्थामा थिच्नु हुँदैन?',
    options: ['ओरालोमा', 'उकालोमा', 'सिधा सडकमा', 'कुनै पनि'],
    correctAnswer: 0
  },
  {
    id: '34',
    text: '34) मोटरसाइकलको अधिकतम गति कहाँ राख्नुपर्छ?',
    options: ['सहरी इलाका', 'खाली सडक', 'अस्पताल नजिक', 'कुनै पनि'],
    correctAnswer: 0
  },
  {
    id: '35',
    text: '35) सवारी चलाउँदा मोबाइल प्रयोग गर्नु उपयुक्त हो?',
    options: ['हो', 'होइन', 'कहिलेकाहीं', 'शर्तमा'],
    correctAnswer: 1
  },
  {
    id: '36',
    text: '36) सवारी चालक अनुमतिपत्र कसले वितरण गर्छ?',
    options: ['जिल्ला प्रशासन कार्यालय', 'यातायात व्यवस्था विभाग', 'सार्वजनिक निकाय', 'कुनै पनि'],
    correctAnswer: 1
  },
  {
    id: '37',
    text: '37) सवारी साधन रोक्नुपर्दा कुन बत्ती बल्छ?',
    options: ['ब्रेक लाइट', 'इन्डिकेटर', 'हेडलाइट', 'कुनै पनि'],
    correctAnswer: 0
  },
  {
    id: '38',
    text: '38) सवारीको चक्का परीक्षण किन आवश्यक छ?',
    options: ['सुरक्षा सुनिश्चित गर्न', 'गति बढाउन', 'चिप्लनबाट बच्न', 'दुवै १ र ३'],
    correctAnswer: 3
  },
  {
    id: '39',
    text: '39) ट्राफिक बत्तीको हरियो बत्ती के गर्नका लागि हो?',
    options: ['सवारी रोक्न', 'सवारी चलाउन', 'सावधानीका लागि', 'पदयात्रीलाई संकेत'],
    correctAnswer: 1
  },
  {
    id: '40',
    text: '40) What is the punishment if a person is killed due to reckless driving?',
    options: ['A few days', 'Life imprisonment with confiscation of property', 'Life imprisonment', '20 years of imprisonment'],
    correctAnswer: 3
  },
 
  

]