import type { Question } from '../types/game';

export const questions: Question[] = [
  {
   
      id: '1',
      text: '1) Which letter is used on the number plate of government motorcycles?',
      options: ['a) ब', 'b) प', 'c) झ', 'd) क'],
      correctAnswer: 0
     
  },
 
  {
    id: '2',
    text: '2) ओभरटेक गर्दा कुन साइडबाट गर्नु पर्छ?',
    options: ['a) बायाँ', 'b) दायाँ', 'c) दुबै', 'd) कुनै पनि होइन'],
    correctAnswer: 1
  },
  {
    id: '3',
    text: '3) What should be checked before starting a vehicle?',
    options: ['a) Brakes', 'b) Lights', 'c) Fuel', 'd) All of the above'],
    correctAnswer: 3
  },
 
  {
    id: '4',
    text: '4) मोटरसाइकल दर्ता गर्ने निकाय कुन हो?',
    options: ['a) यातायात व्यवस्था विभाग', 'b) जिल्ला प्रशासन कार्यालय', 'c) यातायात व्यवस्था कार्यालय', 'd) भौतिक पूर्वाधार तथा यातायात मन्त्रालय'],
    correctAnswer: 2
  },
 
  {
    id: '5',
    text: '5) सहरी इलाकामा सवारी चलाउँदा के गर्नुपर्छ?',
    options: ['a) गति कम गर्नुपर्छ', 'b) गति बढाउनुपर्छ', 'c) सवारी रोक्नुपर्छ', 'd) कुनै पनि होइन'],
    correctAnswer: 0
  },
 
  {
    id: '6',
    text: '6) कुन अवस्था मा सवारी साधन चलाउनु हुँदैन?',
    options: ['a) मादक पदार्थ सेवन गरेर', 'b) कलर छुट्याउन नसक्ने अवस्थामा', 'c) दृष्टि कमजोर हुँदा', 'd) माथिका सबै'],
    correctAnswer: 3
  },
  {
    id: '7',
    text: '7) स्कूल अगाडि सवारी चलाउँदा के गर्नुपर्छ?',
    options: ['a) गति कम गर्नुपर्छ', 'b) हर्न बजाउनु पर्छ', 'c) ओभरटेक गर्नुपर्छ', 'd) माथिका सबै'],
    correctAnswer: 0
  },
  
  {
    id: '8',
    text: '8) तपाईंको सवारी पछाडि एम्बुलेन्स आएमा के गर्नुपर्छ?',
    options: ['a) सवारी रोक्नु', 'b) साइड दिनु', 'c) गति बढाउनु', 'd) ओभरटेक गर्नु'],
    correctAnswer: 1
  },

  
  {
    id: '9',
    text: '9) सवारी चालक अनुमतिपत्र लिन कस्तो स्वास्थ्य अवस्था हुनु पर्छ?',
    options: ['a) दृष्टि राम्रो', 'b) शारीरिक स्वास्थ्य राम्रो', 'c) ट्राफिक नियमको ज्ञान', 'd) माथिका सबै'],
    correctAnswer: 3
  },
  {
    id: '10',
    text: '10) नेपालमा सबैभन्दा बढी दर्ता भएको सवारी साधन कुन हो?',
    options: ['a) कार', 'b) १८ बस', 'c) मोटरसाइकल', 'd)  ई–रिक्सा'],
    correctAnswer: 2
  },
  {
    id: '11',
    text: '11) सवारी चालकले हेल्मेट किन लगाउनुपर्छ?',
    options: ['a) सजिलोका लागि', 'b) सुरक्षाका लागि', 'c) सजावटका लागि', 'd) कुनै पनि होइन'],
    correctAnswer: 1
  },
  {
    id: '12',
    text: '12) सवारीको इन्धन कति समयमा जाँच गर्नुपर्छ?',
    options: ['a) दैनिक', 'b) हप्तामा', 'c) महिनामा', 'd) हप्तामा २ पटक'],
    correctAnswer: 0
  },
  {
    id: '13',
    text: '13) पानी परेको बेलामा विशेष ध्यान पुर्याउनु पर्ने कुराहरू के के हुन्?',
    options: ['a) सडकको सतह', 'b) ब्रेकको स्थिति', 'c) पदयात्रीलाई क्षति नपुर्याउने', 'd) माथिका सबै'],
    correctAnswer: 3
  },
  
  {
    id: '14',
    text: '14) सवारी चलाउँदा नियमित चेकअप किन आवश्यक छ?',
    options: ['a) खर्च कम गर्न', 'b) दुर्घटना टार्न', 'c) समय बचाउन', 'd) कुनै पनि'],
    correctAnswer: 1
  },
  {
    id: '15',
    text: '15) पदयात्रीले सडक कहाँबाट काट्नुपर्छ?',
    options: ['a) जेब्रा क्रस', 'b) सडकको बिचबाट', 'c) जहाँ पनि', 'd) कुनै पनि'],
    correctAnswer: 0
  },
  {
    id: '16',
    text: '16) मोटरसाइकलको सर्भिस कहिले गर्नु पर्छ?',
    options: ['a) मात्र बिग्रिएपछि', 'b) हप्तामा एकपटक', 'c) महिनामा एकपटक', 'd) निश्चित समयमा'],
    correctAnswer: 3
  },
  {
    id: '17',
    text: '17) सवारी चालक अनुमतिपत्रको म्याद कति समयसम्मको हुन्छ?',
    options: ['a) १ वर्ष', 'b) २ वर्ष', 'c) ५ वर्ष', 'd) १० वर्ष'],
    correctAnswer: 2
  },
 
  {
    id: '18',
    text: '18) सवारी साधनको चक्का चिप्लनबाट बच्न के गर्नुपर्छ?',
    options: ['a) ब्रेक हल्का थिच्ने', 'b) ब्रेक बेस्सरी थिच्ने', 'c) क्लच थिच्ने', 'd) गति बढाउने'],
    correctAnswer: 0
  },
  
  {
    id: '19',
    text: '19) सवारी चालकले ट्राफिक नियम पालना नगर्दा के हुन सक्छ?',
    options: ['a) दण्ड', 'b) जरिवाना', 'c) सवारी रोक्का', 'd) माथिका सबै'],
    correctAnswer: 3
  },
 
  {
    id: '20',
    text: '20) सवारी चालक अनुमतिपत्र लिन कुन परीक्षा दिनुपर्छ?',
    options: ['a) लेखित', 'b) व्यावहारिक', 'c) दुवै', 'd) कुनै पनि'],
    correctAnswer: 2
  },

  {
    id: '21',
    text: '21) सहरी इलाकामा अधिकतम गति कति हुनुपर्छ?',
    options: ['a) ४० किमी/घंटा', 'b) ५० किमी/घंटा', 'c) ७० किमी/घंटा', 'd) १०० किमी/घंटा'],
    correctAnswer: 0
  },
  {
    id: '22',
    text: '22) Which color number plate indicates a public vehicle?',
    options: ['a) Red', 'b) Green', 'c) Black', 'd) Blue'],
    correctAnswer: 2
  },
 
  {
    id: '23',
    text: '23) सवारी साधनको पछाडिको रातो बत्ती कहिले बल्छ?',
    options: ['a) एसेलेटर बढाउँदा', 'b) ब्रेक थिच्दा', 'c) हर्न बजाउँदा', 'd) कुनै पनि'],
    correctAnswer: 1
  },
 
 
  {
    id: '24',
    text: '24) सवारी साधन चलाउँदै गर्दा कस्तो अवस्थामा ब्रेक प्रयोग गर्नु हुँदैन?',
    options: ['a) ओरालोमा', 'b) मोडमा', 'c) गति बढाउँदै गर्दा', 'd) माथिका सबै'],
    correctAnswer: 2
  },
 
  {
    id: '25',
    text: '25) यातायात व्यबस्था विभागले कुन कार्य सम्पादन गर्दछ?',
    options: ['a) सवारी दर्ता', 'b) सवारी अनुमतिपत्र वितरण', 'c) सवारी कर संकलन', 'd) माथिका सबै'],
    correctAnswer: 3
  },
  {
    id: '26',
    text: '26) सार्वजनिक सवारी साधनमा कतिजना सम्मले यात्रा गर्न पाउँछन्?',
    options: ['a) १५ जनाले', 'b) २० जनाले', 'c) ३० जनाले', 'd) सीट संख्या बराबर'],
    correctAnswer: 3
  },
 
  {
    id: '27',
    text: '27) सवारी साधनले हरियो नम्बर प्लेट प्रयोग गर्दा के जनाउँछ?',
    options: ['a) सरकारी सवारी', 'b) डिप्लोम्याटिक सवारी', 'c) पर्यटक सवारी', 'd) सार्वजनिक सवारी'],
    correctAnswer: 2
  },
  
  {
    id: '28',
    text: '28) ट्राफिक बत्तीको पहेलो बत्तीले के जनाउँछ?',
    options: ['a) रोक्न', 'b) सावधान हुन', 'c) आगाडि बढ्न', 'd) कुनै पनि होइन'],
    correctAnswer: 1
  },
  {
    id: '29',
    text: '29) What is the  amount required to obtain a motorcycle driving license?',
    options: ['a) Rs. 700', 'b) Rs. 1000', 'c) Rs. 1500', 'd) Rs. 2000'],
    correctAnswer: 2
  },
  {
    id: '30',
    text: '30) विद्युतीय सवारीमध्येको कुन सवारी साधन विद्युतीय (इलेक्ट्रिक) होइन?',
    options: ['a) ई–रिक्सा', 'b)  ट्रली बस', 'c) ग्यास टेम्पो', 'd) मेट्रो सबवे'],
    correctAnswer: 2
  },
  {
    id: '31',
    text: '31) सवारी साधनको लेन परिवर्तन गर्दा के गर्नुपर्छ?',
    options: ['a) साइडलाइट दिनु', 'b) हेर्नु', 'c) गति घटाउनु', 'd) माथिका सबै'],
    correctAnswer: 3
  },
  {
    id: '32',
    text: '32) Which type of vehicle has a white number plate?',
    options: ['a) Government vehicle', 'b) Public vehicle', 'c) Institutional vehicle', 'd) Tourist vehicle'],
    correctAnswer: 0
  },
  {
    id: '33',
    text: '33) मोटरसाइकलको क्लच कस्तो अवस्थामा थिच्नु हुँदैन?',
    options: ['a) ओरालोमा', 'b) उकालोमा', 'c) सिधा सडकमा', 'd) कुनै पनि'],
    correctAnswer: 0
  },
  {
    id: '34',
    text: '34) रातको समयमा गाडी पार्क गर्दा बालिने लाइट कुन हो?',
    options: ['a) हेडलाइट', 'b) साइड लाइट', 'c) पार्किङ लाइट', 'd) इमर्जेन्सी लाइट'],
    correctAnswer: 2
  },
  {
    id: '35',
    text: '35) मोटरसाइकलको सवारी चालक अनुमति पत्र (लाइसेन्स) लिनका लागि कति वर्ष उमेर पूरा भएको हुनुपर्छ?',
    options: ['a) १६ वर्ष', 'b) १७ वर्ष', 'c) १८ वर्ष', 'd) २० वर्ष'],
    correctAnswer: 0
  },
  {
    id: '36',
    text: '36) सवारी चालक अनुमतिपत्र कसले वितरण गर्छ?',
    options: ['a) जिल्ला प्रशासन कार्यालय', 'b) यातायात व्यवस्था विभाग', 'c) सार्वजनिक निकाय', 'd) कुनै पनि'],
    correctAnswer: 1
  },
  {
    id: '37',
    text: '37) सवारी साधन रोक्नुपर्दा कुन बत्ती बल्छ?',
    options: ['a) ब्रेक लाइट', 'b) इन्डिकेटर', 'c) हेडलाइट', 'd) कुनै पनि'],
    correctAnswer: 0
  },
  {
    id: '38',
    text: '38) सवारीको चक्का परीक्षण किन आवश्यक छ?',
    options: ['a) सुरक्षा सुनिश्चित गर्न', 'b) गति बढाउन', 'c) चिप्लनबाट बच्न', 'd) दुवै १ र ३'],
    correctAnswer: 3
  },
  {
    id: '39',
    text: '39) ट्राफिक बत्तीको हरियो बत्ती के गर्नका लागि हो?',
    options: ['a) सवारी रोक्न', 'b) सवारी चलाउन', 'c) सावधानीका लागि', 'd) पदयात्रीलाई संकेत'],
    correctAnswer: 1
  },
  {
    id: '40',
    text: '40) What is the punishment if a person is killed due to reckless driving?',
    options: ['a) A few days', 'b) Life imprisonment with confiscation of property', 'c) Life imprisonment', 'd) 20 years of imprisonment'],
    correctAnswer: 3
  },
 
  

]